Revit 2024 API
TemperatureRatingTypeSet.Contains Method
Tests for the existence of a TemperatureRating type within the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Contains(
	TemperatureRatingType item
)
Visual Basic
Public Overridable Function Contains ( _
	item As TemperatureRatingType _
) As Boolean
Visual C++
public:
virtual bool Contains(
	TemperatureRatingType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Electrical.TemperatureRatingType
The TemperatureRating type to be searched for.
Return Value
The Contains method returns True if the TemperatureRating type is within the set, otherwise False.
See Also
TemperatureRatingTypeSet Class
Autodesk.Revit.DB.Electrical Namespace